# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

number = int(input('Введите трехзначное число: '))
num_a = number % 10
num_b = (number//10) % 10
num_c = (number//100) % 10

print(f'Сумма цифр числа {number} равна {num_a+num_b+num_c} ({num_c} + {num_b} + {num_a}).')
