help = ('Выберите действие с телефонной книгой:\n'
    '[open] открыть файл\n'
    '[save] сохранить файл\n'
    '[show] посмотреть контакты\n'
    '[find] найти контакт\n'
    '[add] добавить контакт\n'
    '[change] изменить контакт\n'
    '[del] удалить контакт\n'
    '[help] справка\n'
    '[exit] выход')

open_text = 'Телефонная книга открыта'
save_text = 'Телефонная книга сохранена'
exit__text = 'Работа завершена', 
add_text = 'Контакт успешно добавлен'
change_text = 'Контакт успешно изменен'
del__text = 'Контакт успешно удален'
not_open = 'Прежде чем начать работу с телефонной книгой нужно ее открыть'