# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
# А русские буквы оцениваются так:
# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков

#     Напишите программу, которая вычисляет стоимость введенного пользователем слова.
#     Будем считать, что на вход подается только одно слово, которое содержит либо
#     только английские, либо только русские буквы.

#     ноутбук
#     12

score_dict = { 'A': 1, 'E': 1, 'I': 1, 'O': 1, 'U': 1, 'L': 1, 'N': 1, 'S': 1, 'T': 1, 'R': 1, 'D': 2, 
              'G': 2, 'B': 3, 'C': 3, 'M': 3, 'P': 3, 'F': 4, 'H': 4, 'V': 4, 'W': 4, 'Y': 4, 'K': 5, 
              'J': 8, 'X': 8, 'Q': 10, 'Z': 10, 'А': 1, 'В': 1, 'Е': 1, 'И': 1, 'Н': 1, 'О': 1, 'Р': 1, 
              'С': 1, 'Т': 1, 'Д': 2, 'К': 2, 'Л': 2, 'М': 2, 'П': 2, 'У': 2, 'Б': 3, 'Г': 3, 'Ё': 3, 
              'Ь': 3, 'Я': 3, 'Й': 4, 'Ы': 4, 'Ж': 5, 'З': 5, 'Х': 5, 'Ц': 5, 'Ч': 5, 'Ш': 8, 'Э': 8, 
              'Ю': 8, 'Ф': 10, 'Щ': 10, 'Ъ': 10 }

print()
print('Настольная игра Скрабл (Scrabble)')
print('Узнай стоимость своего слова.')
print()
round = int(input('Введите количество раундов: '))
name_player_01 = input('Введите имя первого игрока: ')
name_player_02 = input('Введите имя второго игрока: ')

sum_player_01 = 0
sum_player_02 = 0
count = 1

while count <= round:
    print()
    print(f'Раунд № {count}!')
    print()

    player_01 = input(f'{name_player_01}, введите слово: ').upper()
    cost_player_01 = 0
    for item in player_01:
        cost_player_01 += score_dict[item]
        print(f'Буква {item} = {score_dict[item]}.')
    sum_player_01 += cost_player_01
    print(f'Стоимость слова {player_01} равна {cost_player_01}.')
    print(f'Всего очков у игрока {name_player_01}: {sum_player_01}.')

    print()

    player_02 = input(f'{name_player_02}, введите слово: ').upper()
    cost_player_02 = 0
    for item in player_02:
        cost_player_02 += score_dict[item]
        print(f'Буква {item} = {score_dict[item]}.')
    sum_player_02 += cost_player_02
    print(f'Стоимость слова {player_02} равна {cost_player_02}.')
    print(f'Всего очков у игрока {name_player_02}: {sum_player_02}.')

    count +=1

print()
if sum_player_01 > sum_player_02:
    print(f'Ура!!! С количеством баллов {sum_player_01} побеждает {name_player_01}!!!')
else:
    print(f'Ура!!! С количеством баллов {sum_player_02} побеждает {name_player_02}!!!')
print()